Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/E21B.tmx
Source language: en_us
Languages: zh_cn

source: How to Wear a Scarf in 5 Different Ways
zh_cn: 围巾的五种不同系法

source: Wearing a scarf is all about attitude.
zh_cn: 系围巾事关态度。

source: The right neck dressing can take an ensemble to the next level and can take a look from good to great.
zh_cn: 恰当的颈脖服饰能画龙点睛，令装束从不错变成到棒极了。

source: From a simple knit scarf to an exorbitant Hermes, they all need to be tied in a way that complements your winter look with warmth and style.
zh_cn: 不论是简单的针织围巾还是奢华的爱马仕围巾，要是系得恰到好处，都能给你的冬季装束带来温暖又平添时尚感。

source: Here are 5 ways of wearing a scarf.
zh_cn: 下面就是围巾的五种系法。

source: French/European knot
zh_cn: 1法式／欧式结

source: The most popular of all, this knot is perfect for day-to-day wear.
zh_cn: 这是最流行的系法，适用于日常穿戴。

source: Take the scarf and fold it in half, lengthwise.
zh_cn: 把围巾对折，长度适中。

source: Lay it across your neck, and draw the loose ends of the scarf through the other end.
zh_cn: 围上脖子，把两头穿进折过来的那个套。

source: Don't pull it too tight.
zh_cn: 不要拉太紧。

source: The casual noose effect goes down well for a sleek urban winter look.
zh_cn: 这种松松套起来的效果很适合精练的都市冬季装束。

source: If you are wearing a casual aviator jacket, this European knot is the perfect neck-addition.
zh_cn: 如果你穿的是休闲的飞行员夹克，这欧式结就是完美的点睛之笔。

source: The double flip/single knot
zh_cn: 2双反绕

source: Place the scarf around your neck so that the two ends are at your back, cross the ends at the back of your neck and bring them around to the front.
zh_cn: 把围巾反绕过脖子，这样围巾两头都搭在你的背上，再在脖子后边交叉，把两头带到前面来。

source: Leave the noose tight or loose as per your choice and comfort level.
zh_cn: 你自己决定是绕紧还是绕松，舒服就行。

source: Appropriate for a laidback mode, you can tuck them into your jacket or let them hang loose.
zh_cn: 你可以把两头塞进你的夹克，或者就让它们那么松松挂着，显得随意。

source: Perfect weekender look!
zh_cn: 好一个完美的周末装束！

source: Triangular fold
zh_cn: 3三角叠

source: This works best with cotton square scarves with small patterns and short fringes.
zh_cn: 这种系法最好用棉质的方形围巾，有纹状图案和短流苏。

source: Fold the square in half, making a triangle.
zh_cn: 把方形对折成三角。

source: Grab the two ends of the folded edge and tie them together at the back of your neck, leaving the triangular point front and center, facing down.
zh_cn: 抓住折起的两端系在你的脖子后，让三角的那头正中落于胸前。

source: It became famous with the Islamic provinces, prevalent as a Keffiyeh.
zh_cn: 这种系法随着伊斯兰省份阿拉伯头饰的盛行而出名。

source: Basically a patterned piece of clothing is more suited for this very casual look.
zh_cn: 基本上有图案的布料更适合这种非常休闲的装束。

source: Can be easily teamed up with a casual aviator jacket.
zh_cn: 一件休闲的飞行员夹克就正好。

source: Overhand knot
zh_cn: 4手结

source: Oh boy! Easiest of the lot.
zh_cn: 噢！这是最简单的系法。

source: If you know how to tie a shoelace, you're set.
zh_cn: 你只要知道怎么系鞋带就行了。

source: Lay it across your shoulder, take both ends of the scarf and tie them over and under.
zh_cn: 把围巾搭在肩头，把两头系起来绕一下。

source: This style is not one exactly for the colder occasions and only takes care of mild autumnal breeze.
zh_cn: 这种风格可对付不了更寒冷的天气，只能稍微避点秋风。

source: Appropriate for a business look, this Windsor style knot will achieve the desired look with a thin light weight scarf.
zh_cn: 这种温莎式样的结最好用轻薄的围巾，适用于商务装束。

source: Classic Drape
zh_cn: 5经典裹

source: Simply drape the scarf around your neck and tuck into your coat, covering the chest area left exposed by the coat's neckline.
zh_cn: 简单地把围巾裹在脖子上，塞进外套，盖在胸前，就露出外套领子上面那块。

source: Well suited for any formal winter occasion, will get you the ultimate elegance and warmth accompanied with a double breasted trench coat over a slim suit.
zh_cn: 这适合于任何正式的冬季场合，与贴身套装加风衣一起搭配会让你显得格外高雅而且温暖。

source: Sporting a casual look with a muffler and a little formal one with a scarf, this must-have fashion accessory has made itself an absolute necessity than luxury.
zh_cn: 短绒围巾显得运动休闲，围巾就稍微正式点，这件必不可少的时尚配件已经成了绝对必需品而非奢侈品。
